tutorials/untested/reactingCylSimple/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-2e-2 -2e-2 -5e-2)
    (2e-2 -2e-2  -5e-2)
    (2e-2  2e-2  -5e-2)
    (-2e-2  2e-2 -5e-2)
    (-2e-2 -2e-2 5e-2)
    (2e-2 -2e-2 5e-2)
    (2e-2  2e-2 5e-2)
    (-2e-2  2e-2 5e-2)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 40 100) simpleGrading (1 1 1)
);

boundary
(	
	// -- sides of the geometry
    sides
    {
        type patch;
        faces
        (
			(0 4 7 3)
            (3 7 6 2)
            (1 5 4 0)
            (2 6 5 1)
        );
    }
	// -- inlet into geometry
    inlet
    {
        type patch;
        faces
        (
			(0 3 2 1)
            
        );
    }
	// -- outlet from geometry
    outlet
    {
        type patch;
        faces
        (
			(4 5 6 7)
        );
    }
);

// ************************************************************************* //
